app/controllers/captions_controller.rb

SELECT "captions".* FROM "captions"
---
    def progress
        @captions = Caption.all

SELECT "captions".* FROM "captions" WHERE "captions"."recordID" = ?  [["recordID", "test2"]]
---
    def progress_id
        @recordID = params[:id]
        @caption = Caption.where(recordID: @recordID)

SELECT  "captions".* FROM "captions" WHERE "captions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
        def find_record_by_id
            @captionfile = Captions.find(params[:id])